namespace VMMS
{
    /// <summary>  
    /// 取号状态数据操作类
    /// 创建人：dinid
    /// 创建日期：20200416
    /// 版本：1.0
    /// 修改日期：
    /// </summary>
    public enum EnumBillStatus
    {
        /// <summary>
        /// 6位  5位    4位  3位    2位  1位
        /// -------     --------    --------
        /// 流   程     流程处理    预置处理步骤
        /// </summary>
        /// <summary>
        /// 6位  5位    4位  3位    2位  1位
        /// -------     --------    --------
        /// 流   程     流程处理    预置处理步骤
        /// </summary>

        //录入流程
        //新增 = 101010,
        保存 = 103010, 
        //修改 = 103030,
        完成 = 103050,


        //收款流程
        //待收款   = 170100,
        //改金额   = 170300,
        已收款   = 170700,
        //票据打印 = 170800,

        作废 = 990000,
        退库 = 990900,
        //删除 = 999999,
    }
}